Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །བཞིན་བཟངས་དག་དེའི་ཚེ་དེའི་དུས་ན་ཐེ་ཚོམ་དུ་གྱུར་པའི་སྲོག་ཆགས་བྱེ་བ་མང་པོ་དང་བཅས་ཏེ་སངས་རྒྱས་ལ་མི་སྙན་པའི་བར་དུ་ཟེར་བ་ཤོར་བ་གཞོན་ནུའི་ཚུལ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་སྙམ་དུ་ཁྱོད་ཐེ་ཚོམ་མམ། ཡིད་གཉིས་སམ། སོམ་ཉི་ཟ་བར་གྱུར་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བདུད་སྡིག་ཅན་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་ཤོར་བ་གཞོན་ནུའི་ཚུལ་ཞེས་བྱ་བར་གྱུར་ཏེ། གང་དེའི་ཚེ་ངས་དེའི་འཁོར་རབ་ཏུ་ཕྱུང་ནས་དེའི་ཕྱིར་ང་ལ་སེམས་རབ་ཏུ་ཁྲོ་བ་བསྐྱེད་ནས་ཕྱིས་སྨོན་ལམ་བཏབ་སྟེ། ཁྱོད་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ་ཁྱོད་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཅིག་ཅེས་བྱས་སོ།
en: “You, O noble children, became disaffected when you were in the presence of the thus-gone Splendorous with the Gentle Glow of Light and Fragrance.

source: །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེ་ལ་མ་དད་ཅིང་མ་བསྡམས་པའི་ཚིག་སྨྲས་ཏེ།
en: You talked without self-control and harbored wrong views.

source: སྡིག་པའི་ལྟ་བར་སོང་བ་བཟུང་ནས། ངས་ཁྱེད་སྡིག་པའི་ལྟ་བར་སོང་བ་དེ་ལས་ཀུན་ཐར་བར་བྱས་ཏེ་རབ་ཏུ་ཕྱུང་ནས།
en: Consequently, I released you from the evil of your wrong views and made you take up the life of renunciation.

source: དེ་ཚུན་ཆད་ཁྱེད་ཀྱིས་སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་ཏེ། དེ་དག་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱས།
en: From then on you have attended upon many thousands of buddhas and worshiped them with offerings.

source: དེ་དག་ལས་ཆོས་མཉན་ཏེ་སྨོན་ལམ་བཏབ་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྤྱད་དེ།
en: Having learned the Dharma from them, you made aspirations and practiced the six perfections.

source: ཁྱེད་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ཉེས་པར་སྤྱད་པའི་ལས་དེ་སྔོན་བསྐལ་པ་དུ་མར་ངན་སོང་གསུམ་དུ་སྡུག་བསྔལ་མྱོང་ངོ་།
en: However, because of the bad action previously accumulated by you with your body, speech, and mind, you have endured suffering for many eons in the three miserable realms.

source: །ལས་ཀྱི་སྒྲིབ་པ་དེ་ཉིད་ཀྱིས་ད་ལྟར་བདུད་སྡིག་ཅན་གྱི་གནས་སུ་སྐྱེས་སོ།
en: It is only because of this karmic obscuration that you were born, in your present life, in the abode of Māra , the evil one.”

source: །རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་སྔོན་བྱུང་བའི་ལེའུ་འདི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བཤད་པ་ན། བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་ཙམ་དེ་དག་བུད་མེད་ཀྱི་དངོས་པོ་མི་སྣང་བར་གྱུར་ནས་སྐྱེས་པའི་དངོས་པོར་གྱུར་ཏེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ།
en: While these past events concerning the Ratnaketu dhāraṇī were being narrated by the blessed, thus-gone Śākyamuni, the female characteristics of the five hundred daughters of Māra vanished, and male ones appeared. They gained acceptance that phenomena are unborn.

source: །ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་སྐྱེ་དགུའི་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: Infinite hundreds of thousands of millions of beings beyond count, including gods, humans, and asuras, developed the wish to attain unsurpassed and perfect awakening and entered the path of no return.

source: །དེ་བཞིན་དུ་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: In this way, infinite hundreds of thousands of millions of beings entered the path of no return of both the hearer and solitary buddha vehicles.

source: །ལྷ་དང་མིའི་བུ་མོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ནི་བུད་མེད་ཀྱི་དངོས་པོ་ལས་གྱུར་ཏེ་སྐྱེས་པའི་དངོས་པོ་རྙེད་དོ།
en: For infinite numbers of celestial and human girls, womanhood ceased, and each became a man.

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལ་སྔོན་བྱུང་བའི་ལེའུ་ཞེས་བྱ་སྟེ་གཉིས་པའོ།།
en: This concludes the chapter on the previous lives of the Buddha, the second in the “ Ratnaketu Sūtra

source: །།བམ་པོ་གསུམ་པ།
en: Chapter

source: དེ་ནས་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བཤད་པ་དེའི་ཚེ་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་རྒྱ་ཆེར་སྣང་བས་ཁྱབ་པར་གྱུར་ཏེ།
en: While the Ratnaketu dhāraṇī was being recited by the thus-gone Śākyamuni, the entire Sahā world became clearly visible, illuminated by a powerful light.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་གང་ཡོད་པ་དེ་དག་ན་འདོད་པའི་དབང་ཕྱུག་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་གང་དག་བདུད་བྱེད་པ་དེ་དག་སངས་རྒྱས་ཀྱི་མཐུས་དོགས་པ་སྐྱེས་ཏེ།
en: The one hundred billion lords of sensual pleasure, each one a māra active in one of the one hundred billion worlds of four continents in this buddha field of Śākyamuni, became alarmed by this display of the Buddha’s power and directed their eyes toward this world of four continents.

source: སྣང་བ་ཆེན་པོ་འདི་གང་ནས་བྱུང་ཞེས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལ་བལྟ་ཞིང་བདུད་སྡིག་ཅན་ཞེས་བྱ་བ་གང་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་གནས་པ་དེ་བདག་ཅག་བས་སྟོབས་ཆེ་ཞིང་དབང་ཆེ་ལ་མཐུ་ཆེ་ན།
en: “Where is this light emanating from?” they wondered. “Surely this must be through the power of Māra , the evil one, who lives in that particular world of four continents. He is stronger, mightier, and more powerful than us.”

source: འདི་དེའི་མཐུའམ་སྙམ་ནས། དེ་ནས་བདུད་དེ་དག་གིས་བལྟས་ན་བདུད་སྡིག་ཅན་དེ་མྱ་ངན་གྱི་ཁང་པ་ན་འདུག་ཅིང་ཡིད་རབ་ཏུ་མི་དགའ་བ་དེ་མཐོང་ངོ་།
en: As they looked, however, the māras saw Māra , the evil one, overcome with grief and utterly dejected.

source: །དེ་ནས་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་པོ་དེ་དག་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ག་ལ་བ་དང་བདུད་སྡིག་ཅན་གྱི་ཁང་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་འདོད་པའི་དབང་ཕྱུག་ཅིའི་ཕྱིར་ཐམས་ཅད་དང་ལྡན་པའི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བར་བྱས་ནས།
en: So the one billion māras went to the world of four continents where Māra , the evil one, lived and asked, “Why is it, O lord of sensual pleasures, that you are just sitting there, miserable and overcome with grief, when your entire world sphere is awash with light?”

source: ཁྱོད་མྱ་ངན་གྱི་ཁང་པར་ཞུགས་ཏེ་འདུག །དེ་ནས་འདོད་པའི་དབང་ཕྱུག་གིས་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་པོ་དེ་དག་ལ་རྒྱས་པར་སྨྲས་པ།
en: Māra, the lord of sensual pleasures, then explained the matter at length to the one hundred billion māras:

source: ཀྱེ་གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །ཤཱཀྱའི་རིགས་ལས་ཤིན་ཏུ་གཡོ་དང་སྒྱུར་ལྡན་པའི་དགེ་སྦྱོང་ཞིག་འདིར་སྐྱེས་ཏེ།
en: “As you know, friends, there is a monk from the Śākya clan, a trickster and rogue of the worst kind.

source: དེ་སྐྱེས་མ་ཐག་ཏུ་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བར་བྱས། རབ་ཏུ་གཡོས་པར་བྱས། འཁྲུགས་པར་བྱས་ཏེ། དངངས་པར་བྱས་སོ། །འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་འདི་ན་མཁས་པ་གང་སུ་ཚངས་པའི་དབང་པོའམ། ཀླུའི་དབང་པོའམ། གནོད་སྦྱིན་གྱི་དབང་པོའམ། ལྷ་མ་ཡིན་གྱི་དབང་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའམ།
en: As soon as he was born here, the entire Sahā world became filled with light, shook, and trembled.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོའམ། མི་འམ་ཅིའི་དབང་པོ་ནས། གཞན་ཡང་མི་དང་མི་མ་ཡིན་པའི་བར་དུ་མཁས་པ་སུ་ཡང་རུང་། དེ་དག་ཐམས་ཅད་དེ་ལ་མཆོད་པའི་ཕྱིར་འདོང་ངོ་། །ལོ་དྲུག་གི་བར་དུ་གཅིག་པུ་གཉིས་སུ་མེད་པར་འདུག་སྟེ།
en: Whatever intelligent beings there were in this entire world sphere—the lords of brahmās, nāgas, yakṣas, asuras, mahoragas, garuḍas, kinnaras, and other intelligent human and nonhuman beings—all went to him to offer worship for the last six years.

source: མཚན་ཉིད་མེད་པའི་སྒྱུ་མ་བསྒྲུབས་པས་ཁོ་བོས་ཀྱང་རང་གི་སྟོབས་ཀུན་བསྟན་པར་འདོད་ནས་སྡེ་དང་གཡོག་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་དང་དེའི་དྲུང་དུ་དོང་སྟེ་ཀུན་ཏུ་བསྐོར་ནས་བདུད་ཀྱི་སྟོབས་དང་། རྣམ་པར་འཕྲུལ་པ་དང་རྫུ་འཕྲུལ་དང་། བརྩོན་འགྲུས་དང་། ཕ་རོལ་གནོན་པ་ཐམས་ཅད་བསྟན་ཀྱང་དེའི་སྤུའི་ཁུང་བུ་གཅིག་ཀྱང་དངངས་ཤིང་འཇིགས་པར་བྱ་མ་ནུས་ན་སྟན་དེ་ལས་བསྐྱོད་པ་ལྟ་ཅི་སྨོས། བགེགས་གཞན་བྱ་བར་ལྟ་ག་ལ་ནུས་ཏེ།
en: Sitting alone on his seat, without a companion, he has been creating inauspicious illusions. “I, for my part, desirous to make a show of my military might, approached him in the company of soldiers numbering three hundred sixty billion and surrounded him with displays of power, valor, magical skill, and transformations of my entire army, but I was unable to stir or disturb even a single hair on his body, let alone dislodge him from his seat or assault him some other way. That villain, however, displayed the magical power that he did and made the earth tremble.

source: དམངས་དེས་དེ་ལྟ་བུའི་སྒྱུ་ཤིན་ཏུ་བསྟན་ཅིང་ས་གཡོ་བར་བྱས་པས་ཁོ་བོ་སྡེ་དང་བཅས་ཏེ་ཕམ་ནས་ཤིང་བཅད་པ་བཞིན་དུ་སའི་སྟེང་དུ་ལྷུང་ངོ་། །དེ་དེར་འདུག་སྟེ་དེ་འདྲ་བའི་མཚན་ཉིད་མེད་པའི་སྒྱུ་མ་བསྒྲུབས་ནས་འདི་ལྟར་བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ།
en: “Defeated along with my military, I was like a cut-down tree, prostrate upon the surface of the earth, while he, sitting there on his seat, produced inauspicious illusions of such a kind that my entire domain was overpowered.

source: རིག་པ་བསྒྲུབས་ནས་སྟན་དེ་ལས་ལངས་ཏེ་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་བསྟན་ནས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སེམས་ཅན་སུ་མཁས་ཤིང་ཤེས་པ་དེ་དག་ཀྱང་དེ་ལྟ་བུའི་སྒྱུས་འདུན་པར་བྱས་ཏེ། དེ་དག་གི་སེམས་དང་། འགྲོ་བ་དྲུག་ཏུ་སྐྱེ་བ་དང་། འགྲོ་བ་ཡང་ཁོ་བོས་མི་ཤེས་སོ།
en: Having accomplished the knowledge he sought, he rose from his seat and started instructing beings. Thereupon, all the learned and knowledgeable beings in this world of four continents became astounded, so that I am unable to divine their thoughts or their future destiny within the six realms.

source: །གང་དག་དེ་ལ་སྐྱབས་སུ་དོང་བ་དེ་དག་གི་སྤུའི་ཁུང་བུ་གཅིག་ཙམ་ཡང་དངངས་པ་དང་འཁྲུགས་པར་ཁོ་བོས་བྱེད་མ་ནུས་ན་དེ་ལ་སླུ་བའམ་བསྐྱོད་པར་ལྟ་ག་ལ་ནུས་ཏེ།
en: I am unable to stir or disturb even a single hair of those who took refuge with him, let alone mislead them about him, or pry them away from him.

source: དེང་ཁོ་བོའི་གཡོག་མོ་ལྔ་བརྒྱ་དང་། བུ་ཉི་ཁྲིའི་ཚོགས་ཀྱི་འཁོར་དང་བཅས་ཏེ། དགེ་སྦྱོང་གཽ་ཏ་མ་དམངས་དེ་ལ་སྐྱབས་སུ་དོང་ནས་ཆོས་ཉན་པའི་ཕྱིར་དེའི་མདུན་ན་འཁོད་དེ། ཁོ་བོས་དེ་དག་དེ་དང་ཕྲལ་བར་མ་ནུས་སོ།
en: “And now my five hundred daughters with their retinues, as well as my twenty thousand sons with their followers, have taken refuge with that villainous monk, Gautama, and sit in front of him in order to listen to the Dharma, while I no longer have the power to persuade them to leave him.

source: །དེའི་ཕྱིར་སྟོབས་དང་ལྡན་པ། བསོད་ནམས་དང་ལྡན་པ། ཤེས་པ་དང་ལྡན་པ།
en: For this reason, you, being powerful, full of merits, knowledgeable, and mighty, must help me.

source: དབང་ཕྱུག་དང་ལྡན་པ་ཁྱོད་ཁོ་བོའི་གྲོགས་གྱིས་དང་། ཤཱཀྱའི་བུ་དམངས་དེ་སྲོག་དང་དབྲལ་ལོ།
en: We need to stamp the life out of that villainous son of the Śākyas.

source: །དེ་ལ་སེམས་ཅན་གང་དག་སྐྱབས་སུ་སོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རྣམ་པར་གཞིག་པར་བྱའོ། །དགེ་སྦྱོང་གཡོ་སྒྱུ་ཅན་ནག་པོའི་ཕྱོགས་ཕམ་པར་བྱས་ཏེ། བདུད་ཀྱི་ཕྱོགས་དཀར་པོ་སྣང་བར་བྱས་ལ།
en: And whatever beings have taken refuge with him, we must annihilate them too. We will defeat the black faction of that deceitful monk, and bring glory to the white faction of Māra.

source: དེ་ཕྱིན་ཆད་བདེ་བ་ལ་རེག་པར་གནས་པར་བྱའོ།
en: We will then be able to live happily ever after.”

source: །དེ་ནས་བདུད་མེ་འོད་ཅེས་བྱ་བས་འཛམ་བུའི་གླིང་འདི་གང་ན་དེ་བཞིན་གཤེགས་པ་བཞུགས་ཤིང་ཆོས་འཆད་པ་ལ་བལྟས་པ་དང་། དེ་ནས་བདུད་མེ་འོད་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་མཐོང་།
en: Now, the māra Jyotiṣprabha looked toward Jambudvīpa where the Thus-Gone One was sitting and teaching the Dharma.

source: སྒྲ་དབྱངས་དང་ལྡན་པའི་ཆོས་སྟོན་པ་ཐོས་སོ། །མཐོང་ནས་དེ་སྤུ་ཟིང་ཞེས་བྱེད་ཅིང་དངངས་པར་གྱུར་ཏེ།
en: When he saw the Blessed One’s body and heard the sound of his Dharma talk, he was awed and the thrill of it caused the hairs on his body to stand on end.

source: དེ་ནས་དེས་བདུད་སྡིག་ཅན་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: He said to Māra , the evil one: “With his exquisite form, he stands supreme over the entire buddha field.

source: །མ་ལུས་ཞིང་ན་འདི་ནི་གཟུགས་བཟང་མཆོག །བསོད་ནམས་ཤེས་པས་རིང་ནས་གནས་གཙང་སྟེ།
en: He has long been purified through merit and wisdom.

source: །ཉོན་མོངས་རྣམ་གྲོལ་ལམ་ལྡན་ཡུན་རིང་ལོན། །སྲིད་པ་ཀུན་ཟད་མྱ་ངན་རྣམས་ལས་ཐར།
en: Having applied himself to the path over a long time, he is free from the afflictions. As all his links in the chain of becoming have ceased, he is free from sorrow.

source: །ཁྱོད་ཀྱང་མི་རིགས་ཁྲོ་བའི་དབང་མ་འགྲོ།
en: “Do not fall under the sway of anger any more—this is not right!

source: །གཙོ་མཆོག་འདི་ནི་སྲིད་པ་གསུམ་ན་སྐྱབས།
en: As the most eminent and best in the threefold universe, he is an object of refuge.

source: །འདི་ལ་ཞེ་སྡང་ཅུང་ཟད་སུ་སྐྱེད་པ།
en: He in whom burns even a slight feeling of hatred toward him

source: །དེ་ནི་རྨོངས་ཤིང་བདེ་བ་ཉམས་པར་འགྱུར།
en: Is deluded indeed and will be deprived of happiness in this world.”

source: །དེ་ནས་གཞན་ཡང་བདུད་མུ་ཁྱུད་བཟང་པོ་ཞེས་བྱ་བས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then another māra, Sannimika by name, addressed Māra , the evil one, thus:

source: །དེ་ནི་འཕྲུལ་ཆེན་བསོད་ནམས་རབ་ཀྱི་མཚན།
en: “He possesses great magical power and the excellent marks of merit.

source: །མི་གནས་འགྲོ་བ་ཀུན་ལས་རབ་ཏུ་ཐར།
en: Not stuck anywhere, he is free from all destinies.

source: །སྡུག་བསྔལ་མ་ལུས་ཟད་པའི་ལམ་སྟོན་པ།
en: He shows the way leading to the cessation of all suffering

source: །བདུད་བརྒྱ་ཀུན་གྱིས་གཙེ་བར་བྱ་མི་ནུས།
en: And cannot possibly be harmed even by hundreds of māras.”

source: །སྡིག་ཅན་གྱིས་སྨྲས་པ།
en: The evil one replied:

source: ང་ཡི་སྐྱེ་བོ་དག་ལ་དབང་བྱས་ཏེ།
en: “He brought my followers under his control,

source: །ཁྱོད་ཀྱི་སྐྱེ་བོ་འདི་ཡང་དེ་དབང་འགྲོ།
en: And your followers will be brought under his power too.

source: །དེ་ཡིས་རིང་པོར་མི་ཐོགས་ཡུལ་སྟོངས་བྱེད།
en: Soon he will empty our entire domain.

source: །འུ་བུ་ཅག་ཀྱང་གང་དུ་འགྲོ་བར་འགྱུར།
en: Where shall we resort to after that?”

source: །དེ་ནས་བདུད་ནགས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The māra Navarāja said this to Māra , the evil one:

source: །ཁྱོད་ནི་རབ་ཏུ་འབྱོར་པར་གྱུར་པའི་ཚེ།
en: “If you had superior magical power,

source: །དེ་ན་ཁྱོད་ཀྱིས་རང་གི་དཔའ་བ་བསྟན།
en: You would be able to prove your prowess.

source: །ད་ནི་རབ་ཏུ་དཔུང་ཉམས་རེ་ཆད་ན།
en: Your force, however, is spent and all hope is gone.

source: །དེ་རིང་ཅི་ཕྱིར་ཐམས་ཅད་མཁྱེན་ལ་སྡོ།
en: Why, then, do you still compete with him, the Omniscient One?”

source: །བདུད་རལ་གྲི་ཟླ་བ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The māra Khaḍgasoma said:

source: །དེ་ནི་སུ་ལའང་ཡིད་ཀྱི་ཁྲོ་བ་མེད།
en: “There is no enmity in his mind toward anyone.

source: །མི་གནས་དེ་ནི་བསམ་པ་ཉིད་ཀྱིས་གཙང་།
en: Purified by meditation, he does not belong anywhere.

source: །ཁམས་གསུམ་དག་ལས་ཐར་ཞིང་འགྲོ་བ་རྒྱུ།
en: The sphere he resides in is independent of the three realms.

source: །དེ་ལ་གཞན་གྱིས་གསད་པར་མི་ནུས་སོ།
en: He cannot possibly be assailed by others.”

source: འདོད་ཁམས་འདི་ན་སེམས་ཅན་གང་འཁོད་པ།
en: “Whatever beings there are in the desire realm—

source: །འདོད་ལ་ཆགས་ཤིང་ང་རྒྱལ་དྲེགས་པས་མྱོས།
en: Attached to sense pleasures and stupefied by arrogance and pride—

source: །དེ་དག་ང་ཕྱིར་རྟག་འབྲང་ཕྱག་བརྙན་ཏེ།
en: They are my servants who always follow me.

source: །དེ་དག་ཚོགས་པས་ཅི་ཕྱིར་དེ་མི་སོད།
en: How could it be impossible to kill him if we all joined forces?”

source: །དེ་ནས་བདུད་ས་ཆུ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྙིང་པོ་མེད་ཅིང་སྒྱུ་མ་སྨིག་རྒྱུ་འདྲར།
en: The māra Kṣititoya said:

source: །དངོས་པོ་ཀུན་ཤེས་སྲིད་པ་རྣམ་པར་བརྟུལ།
en: “Knowing that objects are without essence Like an illusion, a mirage, or a reflected image, he has subdued his craving.

source: །སྲིད་པར་མ་ཆགས་ནམ་མཁའི་ངོ་བོ་ཉིད།
en: Unattached to existence, with a sky-like nature,

source: །དེ་ལ་བགེགས་བྱེད་ནུས་པར་ག་ལ་འགྱུར།
en: How could he possibly be obstructed?”

source: མི་ཡི་འཇིག་རྟེན་འདི་ན་དེ་ཡང་ཡོད།
en: “He also depends on things in this threefold universe;

source: །བཟའ་བཏུང་ཞིམ་པོ་སྨན་དང་གོས་རྙེད་ཅིང་།
en: He relies on gourmet food and drink and fine clothes,

source: །ཚོར་བ་གསུམ་ཡང་དེ་ཡི་སེམས་ལ་ཡོད།
en: And the three feelings are firmly rooted in his mind.

source: །ཅི་ཕྱིར་དེ་ལ་བརླག་པར་བྱ་མི་ནུས།
en: How then could it be impossible to destroy him?”

source: །བདུད་སྲེད་སྤོང་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྡིག་ཅན་ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་ནི།
en: The māra Tṛṣṇājaha said:

source: །རྫུ་འཕྲུལ་བདག་ཅག་ཡུལ་ན་ཅི་ཡོད་པ།
en: “Any magical powers that exist in our domain, Whether they are of the evil one himself or the mahoragas,

source: །དོན་གྲུབ་འཕྲུལ་ལ་ཆ་ཤས་མི་རེག་ན།
en: Do not even come close to the powers of Siddhartha.

source: །དེ་ལ་ཇི་ལྟར་བརླག་པར་བྱ་བར་ནུས།
en: How then could it be possible to destroy him?”

source: ངས་ནི་དེ་ལ་ཟན་བཅད་བྱས།
en: “I will cut off his food supply,

source: །དེ་ལ་རྡོ་བ་དག་ཀྱང་འཕངས།
en: Hurl rocks at him,

source: །དེ་བཞིན་མི་སྙན་ཚིག་སྨྲས་ནས།
en: And abuse him verbally—

source: །གནས་དག་ནས་ཀྱང་རབ་ཏུ་བསྐྱོད།
en: Will he not be forced out of his living place then?”

source: །བདུད་ཤེས་མིག་ཅེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The māra Bodhākṣa asked:

source: །ཁྱོད་ཀྱིས་གང་ཚེ་དེ་ལ་བགེགས་བྱས་ཚེ།
en: “When you launched your assaults upon him,

source: །དེ་ནི་ཁྲོས་པས་ཅུང་ཟད་འཚིག་པའམ།
en: Did he ever angrily show you his disapproval,

source: །ཁྱོད་ལ་ཁྲོ་གཉེར་བཞིན་ཡང་བསྟན་བྱས་སམ།
en: Or show you a scowling face?

source: །དེ་ལས་ཁྱོད་ཀྱིས་ཚིག་ངན་མངོན་ཐོས་སམ།
en: Did you directly hear any bad words from him?”

source: དེ་ནི་སོ་སོར་བརྟགས་པས་རྟག་ཏུ་བཟོད།
en: “He always endures things patiently, considering them carefully.

source: །འདོད་ཆགས་སྤངས་ཤིང་ཞེ་སྡང་གཏི་མུག་བྲལ།
en: He has exhausted his passions, and has no hatred or ignorance.

source: །དེ་ནི་སེམས་ཅན་ཀུན་ལ་བྱམས་སེམས་ལྡན།
en: His mind is lovingly disposed toward all beings,

source: །འདྲེ་བར་སྤྱོད་པ་ལ་ཡང་དེ་བརྟག་གོ།
en: Though he is always socially engaged.”

source: །བདུད་ཐུབ་དཀའ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The māra Durdharṣa said: “We can certainly set out to assail those

source: །ཀུན་སྦྱོར་གསུམ་གྱི་ཞགས་པས་གང་བཅིངས་པ། །དེ་ལ་བདག་ཅག་ནན་ཏན་བགེགས་བྱ་མོད། །དེས་ནི་སྐྱོན་དང་གཏི་མུག་ཞགས་པ་སྤངས།
en: Ensnared by the three fetters,

source: སྟོབས་ཐོབ་ཁྱེད་ཅག་ང་ཡི་གྲོགས་ཡིན་ཏེ།
en: “You, gentlemen, my powerful supporters,

source: །ཁྱེད་རྣམས་བག་ཡོད་བྱོས་ལ་དེའུ་རེ་ཆོས།
en: Must stay coolheaded, right now!

source: །ཐམས་ཅད་ཕྱོགས་སུ་རི་ཡི་ཕྲེང་བ་དང་། །ས་འདི་མ་ལུས་བྱིན་གྱིས་ཆུར་བརླབ་བོ།
en: I will transform the entire earth into water— All its quarters with their mountain ranges.

source: །མཁའ་ལས་མི་བཟད་སྟུག་པའི་བྲག་ཆར་དང་། །ལྕགས་ཀྱི་ཕྱེ་མའི་ཕུང་པོ་རབ་ཏུ་དབབ།
en: “I will release a terrible rain of hard rocks

source: །ལྕགས་མདའ་མདུང་ཐུང་སྤུ་གྲི་མདའ་བོ་ཆེ།
en: And heaps of iron filings.

source: །དེ་ལུས་ཕྱེ་མར་བརླག་ཕྱིར་དབབ་པར་བྱ།
en: I will throw at his body arrows, javelins,

source: །ཀུན་ནས་རབ་ཏུ་རྣོ་བའི་རྡོ་རྗེ་དང་། །མདུང་ཐུང་རལ་གྲི་ཐོ་བ་རྣམས་ཕབ་ལ།
en: Razor blades, and spears, to crush him into dust.

source: །འབར་བ་མངོན་འཕངས་སྦྱོར་བ་དེ་དག་གིས།
en: “With these missiles emitting flames on impact

source: །ཤཱཀྱའི་བུ་དེ་ཐལ་བར་བརླག་པར་བྱ།
en: I will crush the lion of the Śākyas to dust.”

source: །དེ་བཞིན་དུ་བདུད་བྱེ་བའི་བར་དུ་ཐམས་ཅད་ཀྱིས་ཚིགས་སུ་བཅད་པ་སྨྲས་སོ། །དེ་ནས་བདུད་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: And so this exchange between the evil one and the other māras continued until ten million stanzas were spoken by the ten million māras, after which all the māras spoke with a single voice: “So be it!

source: །དེ་བཞིན་དུ་འདོང་བར་བགྱིའོ།
en: We will go!

source: །རང་རང་གི་གནས་ནས་གོ་བགོས་ལ་སྡེ་དང་གཡོག་ཏུ་བཅས་ཏེ་འདོང་ངོ་། །བདག་ཅག་གི་རྫུ་འཕྲུལ་དང་། སྟོབས་ཀྱི་ཡུལ་དེ་དག་ཐམས་ཅད་བསྟན་པར་ནི་བྱ་ན།
en: We will now go to our individual abodes, don our armor, and come along with our military cohorts. Whatever magical powers we have at our disposal, we will display them all.

source: དགེ་སྦྱོང་གཽ་ཏ་མ་དེ་རྩལ་ཅི་འདྲ་བ་དེའི་མོད་ལ་རབ་ཏུ་སྟོན་ཏེ།
en: You will then know for yourself, at that time, what valor the monk Gautama will exhibit.”

source: ཁྱོད་རང་གིས་རིགས་པར་འགྱུར་རོ། །དེ་ནས་བདུད་བྱེ་བ་རང་རང་གི་གནས་ནས་གོ་བགོས་ཏེ། བདུད་བྱེ་བ་རེ་རེ་ཞིང་ཡང་གཡོག་སྟོང་སྟོང་ཡ་ལད་རྣམ་པ་མང་པོ་གྱོན་པ།
en: These tens of millions of māras then departed for their respective homes to don their armor, each māra accompanied by tens of thousands of millions of followers.

source: ལག་ཆ་སྣ་ཚོགས་ཐོགས་པ། གོ་ཆ་རྣམ་པ་སྣ་ཚོགས་བགོས་པ་དག་དང་ཆས་ཏེ།
en: All of them donned their coats of mail, armed themselves with different types of weapons, and girded themselves with different types of body armor.

source: དེའི་ནུབ་མོ་འདས་ནས་འཛམ་བུའི་གླིང་འདིར་ཕྱིན་ཏེ། ཡུལ་ཨང་ག་མ་ག་དྷཱའི་དྲང་ཐད་ཀྱི་ནམ་མཁའ་ལ་འཁོད་ནས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་གང་དག་བཅོམ་ལྡན་འདས་ལ་སེམས་མ་དད་ཅིང་གུས་པར་བྱ་བ་ཡིད་ལ་བྱེད་པ་མེད་པར་གྱུར་ལ། ཆོས་དང་དགེ་འདུན་ལའང་སེམས་མ་དད་པ་ཡོད་པ་དེ་དག་ཐམས་ཅད་བདུད་སྡིག་ཅན་གྱིས་བཅོམ་ལྡན་འདས་བགྲོངས་སུ་བཅུག་ནས།
en: As night fell, they traveled to Jambudvīpa and arrayed themselves in the sky above Aṅga-Magadha. Any gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, and kumbhāṇḍas in this world of four continents who harbored ill will toward the Blessed One and who had not attained respect and devotion for him and were also ill-disposed toward the Dharma and the Saṅgha were all mobilized under the command of the evil Māra for the sake of killing the Blessed One.

source: དེ་དག་ཀྱང་ལག་ཆ་དང་། གོ་ཆ་སྣ་ཚོགས་དང་ཆས་ཏེ་དེ་ཉིད་ན་འཁོད་དོ། །བདུད་སྡིག་ཅན་ནི་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་སུ་བསྒྱུར་ནས།
en: Brandishing various weapons and types of armor, they hovered there in the sky.

source: དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བ་དབང་ཕྱུག་ཆེན་པོ་ལ་དད་པ། རིག་པའི་གནས་བཅྭ་བརྒྱད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། རྫུ་འཕྲུལ་གྱི་ཡུལ་གྱི་ཕ་རོལ་ཏུ་སོན་པ། གཡོག་ལྔ་བརྒྱ་ཡོད་པ།
en: Māra , too, went to one side of the Himalaya Mountains where there lived, with a retinue of five hundred, the sage Jyotīrasa, a devotee of Maheśvara who was accomplished in the eighteen branches of knowledge and who had attained excellence in the field of magical arts.

source: གངས་ཀྱི་རིའི་ངོས་ལ་གནས་པ་དེའི་མདུན་དུ་འདུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Having assumed the form of Maheśvara, Māra stood before the sage and said:

source: །གཽ་ཏ་མ་རིགས་ལས་སྐྱེས་པའི་དྲང་སྲོང་མཆོག །མཁས་ཤིང་མངོན་པར་ཤེས་པ་དག་ལག་ན་གནས།
en: “Born into the Gautama clan, the supreme sage has recourse to ordinary knowledge as well as the superknowledges.

source: །ཨང་ག་མ་ག་དྷཱ་ན་དེར་འདུག་དེ་རིང་ནི། །རྒྱལ་པོའི་ཁབ་ཏུ་ངེས་པར་བསོད་སྙོམས་སྤྱོད།
en: He lives in Magadha, where he is now doing alms rounds in the city of Rājagṛha.

source: །བརྟན་པོར་སྣ་ཚོགས་གསལ་བའི་གཏམ་རྣམས་ཀྱིས། །དེ་དང་ཁྱོད་དུ་ལྷན་ཅིག་སྨྲ་བར་བྱོས།
en: You must engage him in conversation at length, being resolute in the pursuit of various topics.

source: །དེར་ཁྱོད་མངོན་ཤེས་དབང་པོ་ལྔ་པོ་ཡང་། །གདོན་མི་ཟ་བར་རབ་ཏུ་ཐོབ་པར་འགྱུར།
en: You will thus certainly obtain the mastery of the five superknowledges.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་ཏེ། དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ནས་རང་གི་གནས་སུ་སོང་སྟེ། རང་གི་འཁོར་གྱི་བདུད་རྣམས་ལ་བསྒོ་བ།
en: Having spoken this stanza, Māra , the evil one, disappeared right there and, having gone to his abode, declared the following to his retinue of māras:

source: ངས་དེང་མི་མཚུངས་བློས་བསམས་ཅི་འདྲ་ང་ལས་ཁྱོད་ཉོན་ཅིག །བདག་ཡུལ་བདུད་ཀྱི་དྲེགས་ཆེན་འཇོམས་པའི་སྒྱུ་དེ་མི་སྟོན་པར།
en: “Please hear from me today what an incomparable scheme I have hatched:

source: །རྫུ་འཕྲུལ་མཐུ་དང་ལྡན་དེ་ཤཱཀྱའི་བུ་ལ་རང་དགར་སྨྲ།
en: Those of you who are endowed with magical powers should unreservedly engage the son of the Śākyas in a friendly conversation. If you keep your great pride, particular to māras, in check, he will not see your deception.

source: །དེ་རྟག་ཚིག་འཇམ་སློབ་མ་དག་ལ་བརྩེ་བ་བུ་ལ་མ་བྱམས་བཞིན། །དེ་ཡི་སློབ་མ་རྒྱགས་སྤངས་གདོན་མི་ཟ་བར་སྔ་དྲོ་ནི།
en: If you continually say nice words, he will be kind to you as one of his disciples, just like a mother is with her children.

source: །གྲོང་ཁྱེར་དག་ཏུ་གཡེང་བ་མེད་པར་མཐར་གྱིས་རྒྱུ་བ་ན།
en: “When his disciples finally go undistractedly to town, As they do every morning, we will promptly captivate them

source: །དེ་དག་གླུ་གར་སྙན་མཆོག་ཚུལ་གྱིས་རང་དགར་མྱུར་དུ་གཟུངས།
en: With the sweetest sentiments expressed through song and dance.

source: །དེ་ཐོས་ཤཱཀྱའི་ཁྱུ་མཆོག་ཅི་ནས་ཡིད་སྤྲོ་མེད་པར་བྱ།
en: The bull of the Śākyas will surely lose his composure When he hears about this event.”

source: །བདུད་གཞན་ཞིག་གིས་སྨྲས་པ།
en: Another māra said: “We shall swiftly produce, outside of this town, many unpleasant sounds—
